//#include <stdio.h>
//
//int main()
//{
//	//int  a = 3;    //指针的类型决定内存操作
//	//int *p1 = &a;  //一级指针装变量的地址
//	//int**p2 = &p1; //二级指针装一级指针的地址
//	//int ***p = &p2;
//	//printf("%d", ***p);
//	//int a[5] = { 3, 4, 5, 6, 7 };
//	//int *p = a;
//	//for (int i = 0; i < 5; i++)
//	//{
//	//	printf("%d  ", *p++);
//	//}
//	//printf("\n");
//	//p = a;
//	//for (int i = 0; i < 5; i++)
//	//{
//	//	printf("%d  ", (*p)++);
//	//}
//	//p = a;
//	//printf("\n");
//	//printf("%d\n", a[0]);
//	//for (int i = 0; i < 5; i++)
//	//{
//	//	printf("%d  ", *(p++));
//	//}     ++ 的优先级高于*
//	int a[5] = { 1, 2, 3, 4, 5 }; // []不是数组专属,下标运算
//	int *p = a;
//	for (int i = 0; i < 5; i++)
//		{
//			printf("%d  ", p[i]);
//		}   
//	printf("%d", 2[p]);  //下标运算先求和,再对内存进行操作
//	while (1);
//
//}